{
  "topics": [
    {
      "id": "1",
      "name": "Cấu trúc chung của một câu trong tiếng Anh"
    },
    {
      "id": "2",
      "name": "Noun phrase (ngữ danh từ)"
    },
    {
      "id": "3",
      "name": "Verb phrase (ngữ động từ)"
    },
    {
      "id": "4",
      "name": "Sự hòa hợp giữa chủ ngữ và động từ"
    }
  ],
  "lessons": [
    {
      "id": "1",
      "title": "Subject (chủ ngữ)",
      "blog": "Chủ ngữ là chủ thể của hành động trong câu, thường đứng trước động từ (verb). Chủ ngữ thường là một danh từ (noun) hoặc một ngữ danh từ (noun phrase - một nhóm từ kết thúc bằng một danh từ, trong trường hợp này ngữ danh từ không được bắt đầu bằng một giới từ). Chủ ngữ thường đứng ở đầu câu và quyết định việc chia động từ. \\n Chú ý rằng mọi câu trong tiếng Anh đều có chủ ngữ (Trong câu mệnh lệnh, chủ ngữ được ngầm hiểu là người nghe. Ví dụ: “Don't move!” = Đứng im!). \n \nMilk is delicious. (một danh từ) \nThat new, red car is mine. (một ngữ danh từ)\n \nĐôi khi câu không có chủ ngữ thật sự, trong trường hợp đó, It hoặc There đóng vai trò chủ ngữ giả.\n \n It is a nice day today\n There is a fire in that building. \n",
      "topic": "1"
    },
    {
      "id": "2",
      "title": " Danh từ đếm được và không đếm được (Count noun/ Non-count noun)",
      "blog": "Dùng the trước một danh từ đã được xác định cụ thể về mặt tính chất, đặc điểm, vị trí hoặc đã được đề cập đến trước đó, hoặc những khái niệm phổ thông, ai cũng biết. \n\n\t\t The boy in the corner is my friend. (Cả người nói và người nghe đều biết đó là cậu bé nào) \n\t\t The earth is round. (Chỉ có một trái đất, ai cũng biết) \n Với danh từ không đếm được, dùng the nếu nói đến một vật cụ thể, không dùng the nếu nói chung. \n\n\t\t Sugar is sweet. (Chỉ các loại đường nói chung) \n\t\t The sugar on the table is from Cuba. (Cụ thể là đường ở trên bàn) \n\n Với danh từ đếm được số nhiều, khi chúng có nghĩa đại diện chung cho một lớp các vật cùng loại thì cũng không dùng the. \n\n Oranges are green until they ripen. (Cam nói chung) \n Athletes should follow a well-balanced diet. (Vận động viên nói chung) \n\n 1.Sau đây là một số trường hợp thông dụng dùng The theo quy tắc trên: \n\n ·The + danh từ + giới từ + danh từ: The girl in blue, the Gulf of Mexico. \n·Dùng trước những tính từ so sánh bậc nhất hoặc only: The only way, the best day.\n ·Dùng cho những khoảng thời gian xác định (thập niên): In the 1990s \n ·The + danh từ + đại từ quan hệ + mệnh đề phụ: The man to whom you have just spoken is the chairman.\n·The + danh từ số ít tượng trưng cho một nhóm thú vật hoặc đồ vật: The whale = whales (loài cá voi), the deep-freeze (thức ăn đông lạnh) \n ·Đối với man khi mang nghĩa “loài người”  tuyệt đối không được dùng the: Since man lived on the earth ... (kể từ khi loài người sinh sống trên trái đất này) \n ·Dùng trước một danh từ số ít để chỉ một nhóm, một hạng người nhất định trong xã hội: The small shopkeeper: Giới chủ tiệm nhỏ/ The top offcial: Giới quan chức cao cấp \n ·The + adj: Tượng trưng cho một nhóm người, chúng không bao giờ được phép ở số nhiều nhưng được xem là các danh từ số nhiều. Do vậy động từ và đại từ đi cùng với chúng phải ở ngôi thứ 3 số nhiều: The old = The old people; \n\t\t The old are often very hard in their moving \n ·The + tên gọi các đội hợp xướng/ dàn nhạc cổ điển/ ban nhạc phổ thông: The Back Choir/ The Philharmonique Philadelphia Orchestra/ The Beatles. \n ·The + tên gọi các tờ báo (không tạp chí)/ tàu biển/ các khinh khí cầu: The Times/ The Titanic/ The Hindenberg \n ·The + họ của một gia đình ở số nhiều = gia đình nhà: The Smiths = Mr/ Mrs Smith and children \n ·Thông thường không dùng the trước tên riêng trừ trường hợp có nhiều người hoặc vật cùng tên và người nói muốn ám chỉ một người cụ thể trong số đó: \n\t\t There are three Sunsan Parkers in the telephone directory. The Sunsan Parker that I know lives on the First Avenue. \n ·Tương tự, không dùng “the”  trước bữa ăn: breakfast, lunch, dinner: \n\t\t We ate breakfast at 8 am this morning. \n Trừ khi muốn ám chỉ một bữa ăn cụ thể: \n\t\t The dinner that you invited me last week were delecious. \n ·Không dùng “The” trước một số danh từ như home, bed, church, court, jail, prison, hospital, school, class, college, university v.v... khi nó đi với các động từ và giới từ chỉ chuyển động chỉ đi đến đó là mục đích chính hoặc ra khỏi đó cũng vì mục đích chính: \n\t\t Students go to school everyday. \n\t\t The patient was released from hospital. \n Nhưng nếu đến đó hoặc ra khỏi đó không vì mục đích chính thì dùng “The”. \n\t\t Students go to the school for a class party. \n\t\t The doctor left the hospital for lunch. /n/n 2.Sử dụng “The” và không sử dụng “The” trong một số trường hợp điển hình \n\n Có “The”: \n\n +Dùng trước tên các đại dương, sông ngòi, biển, vịnh và các cụm hồ (số nhiều) \n The Red Sea, the Atlantic Ocean, the Persian Gufl, the Great Lakes \n +Trước tên các dãy núi: \n The Rocky Mountains +Trước tên những vật thể duy nhất trong vũ trụ hoặc trên thế giới: \n The earth, the moon \n + The schools, colleges, universities + of + danh từ riêng \n The University of Florida \n + The + số thứ tự + danh từ \n The third chapter. \n + Trước tên các cuộc chiến tranh khu vực với điều kiện tên khu vực đó phải được tính từ hoá \n The Korean War (=> The Vietnamese economy)\n + Trước tên các nước có hai từ trở lên (ngoại trừ Great Britain) \n The United States, The Central African Republic \n + Trước tên các nước được coi là một quần đảo hoặc một quần đảo \n The Philipines, The Virgin Islands, The Hawaii \n + Trước tên các tài liệu hoặc sự kiện lịch sử \n The Constitution, The Magna Carta \n + Trước tên các nhóm dân tộc thiểu số the Indians \n + Trước tên các môn học cụ thể \n The Solid matter Physics \n + Trước tên các nhạc cụ khi đề cập đến các nhạc cụ đó nói chung hoặc khi chơi các nhạc cụ đó. \n The violin is difficult to play \n Who is that on the piano \n\n Không “The” \n + Trước tên một hồ \n Lake Geneva \n + Trước tên một ngọn núi \n Mount Vesuvius \n + Trước tên các hành tinh hoặc các chòm sao \n Venus, Mars \n + Trước tên các trường này nếu trước nó là một tên riêng \n Stetson University \n + Trước các danh từ đi cùng với một số đếm \n Chapter three, Word War One \n + Trước tên các nước chỉ có một từ: \n China, France, Venezuela, Vietnam \n + Trước tên các nước mở đầu bằng New, một tính từ chỉ hướng: \n New Zealand, North Korean, France \n + Trước tên các lục địa, tỉnh, tiểu bang, thành phố, quận, huyện: \n Europe, Florida \n + Trước tên bất kì môn thể thao nào baseball, basketball \n + Trước các danh từ trừu tượng (trừ một số trường hợp đặc biệt): \n freedom, happiness \n + Trước tên các môn học nói chung \n mathematics \n + Trước tên các ngày lễ, tết \n Christmas, Thanksgiving \n + Trước tên các loại hình nhạc cụ trong các hình thức âm nhạc cụ thể (Jazz, Rock, classical music..) \n To perform jazz on trumpet and piano",
      "topic": "2"
    },
    {
      "id": "3",
      "title": "Present tenses (các thời hiện tại)",
      "blog": "Bai moi 3",
      "topic": "3"
    },
    {
      "id": "4",
      "title": "Các trường hợp chủ ngữ đứng tách khỏi động từ",
      "blog": "Bai moi 4",
      "topic": "4"
    },
    {
      "id": "5",
      "title": "Các trường hợp chủ ngữ đứng tách khỏi động từ",
      "blog": "Bai moi 4",
      "topic": "1"
    }
  ]
}